# SetZoom

## Description
Procedure SetZoom sets the zoom factor of the active Vectorworks document.&lt;BR&gt;

```pascal
PROCEDURE SetZoom(zoomfactor : LONGINT);
```

```python

def vs.SetZoom(zoomfactor):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|zoomfactor|LONGINT|Zoom percentage setting.|

## Version
Availability: from MiniCAD6.0
## Category
* View / Zoom